design_model/src/main/resources/行为型模式/命令模式/命令模式.md
```mermaid
classDiagram
    class Command {
        <<Abstract>>
        +execute()*
    }
    class ConcreteCommand ["ConcreteCommand(具体命令类)"]{
        -state;
        +execut();
    }
    class Invoker ["Invoker(调用者~亲求发送者)"]{
    }
    class Receiver ["Receiver(接收者)"]{
        +action();
    }
    ConcreteCommand --|> Command
    ConcreteCommand --> Receiver
    Invoker o-- Command
    Client ..> Invoker
    Client ..> ConcreteCommand
```
