design_model/src/main/resources/行为型模式/命令模式/命令模式.puml
@startuml

abstract class Command<<抽象命令类>>{
+{abstract} execute();
}

class ConcreteCommand<<具体命令类>>{
-state;
+execut();
}
class Invoker<<调用者(请求发送者)>>{

}
class Receiver<<接收者>>{
+action();
}

ConcreteCommand -up-|>Command

ConcreteCommand -left->Receiver

Invoker o-right->Command
Client .right.>Invoker
Client .right.>ConcreteCommand


@enduml
